БСП_ВА/src/Catalogs/ОбщиеДанныеИнформационногоЦентра/ОбщиеДанныеИнформационногоЦентра.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ОбщиеДанныеИнформационногоЦентра</name>
  <attributes>
    <name>Вложения</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ВнешняяСсылка</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Дата</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНачалаАктуальности</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОкончанияАктуальности</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Идентификатор</name>
    <type>
      <types>UUID</types>
    </type>
  </attributes>
  <attributes>
    <name>Критичность</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТекстHTML</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипИнформации</name>
    <type>
      <types>CatalogRef.ТипыИнформацииИнформационногоЦентра</types>
    </type>
  </attributes>
</mdclass:Catalog>

БСП_ВА/src/CommonModules/СообщенияИнформационногоЦентраРеализация/Module.bsl
////////////////////////////////////////////////////////////////////////////////
// ОБЩАЯ РЕАЛИЗАЦИЯ ОБРАБОТКИ СООБЩЕНИЙ ИНФОРМАЦИОННОГО ЦЕНТРА
//
////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

// По сообщению формирует элемент справочника "ОбщиеДанныеИнформационногоЦентра"
//
// Параметры:
//	ТелоСообщения - ОбъектXDTO - тело сообщения.
//
Процедура ДобавитьОповещениеОПожелании(ТелоСообщения) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	НачатьТранзакцию();
	Попытка
		ДобавитьОповещениеОПожеланииВСправочник(ТелоСообщения);
		ЗафиксироватьТранзакцию();
	Исключение
		ОтменитьТранзакцию();
		ВызватьИсключение;
	КонецПопытки;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Добавляет оповещение по пожеланию
//
// Параметры:
//	ТелоСообщения - ОбъектXDTO - тело сообщения.
//
Процедура ДобавитьОповещениеОПожеланииВСправочник(ТелоСообщения)
	
	УведомлениеОПожелании                           = Справочники.ОбщиеДанныеИнформационногоЦентра.СоздатьЭлемент();
	УведомлениеОПожелании.Идентификатор             = ТелоСообщения.id;
	УведомлениеОПожелании.Наименование              = ТелоСообщения.name;
	УведомлениеОПожелании.ДатаНачалаАктуальности    = ТелоСообщения.startDate;
	УведомлениеОПожелании.ДатаОкончанияАктуальности = ТелоСообщения.endDate;
	УведомлениеОПожелании.ТипИнформации             = ИнформационныйЦентрСервер.ОпределитьСсылкуТипаИнформации("УведомлениеОПожелании");
	УведомлениеОПожелании.Критичность               = ТелоСообщения.criticality;
	УведомлениеОПожелании.Записать();
	
КонецПроцедуры

#КонецОбласти
